OPENAI_API_KEY="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"
TELEGRAM_BOT_TOKEN="6216264719:AAHzrRhUtFWHpN5SrEmRy12nCcNikhOZqCg"

YOOTOKEN = "381764678:TEST:55600"

DATABASE = '/root/chatgpt_aiogram_bot/database.db'


description = "Уважаемый пользователь,\r\n\r\nСпешим сообщить, что для дальнейшего оптимизирования работы бота на основе инновационных технологий мы предоставляем Вам возможность воспользоваться премиум подпиской. \r\n\r\n🎁 Неувядаемые преимущества, которые Вы будете получать с премиум подпиской:\r\n\r\n✅ Пользование ботом без ограничений.\r\n\r\n✅ Приоритетное обслуживание в очереди запросов.\r\n\r\n✅ Возможность использовать сложные запросы, требующие повышенной вычислительной мощности.\r\n\r\n✅ Снятие ограничений на количество вводимых символов.\r\n\r\nСпасибо, что выбрали наш 🌟 первоклассный сервис для оптимизации Ваших процессов."

MAX_TOKEN_FREE = 1500
MAX_TOKEN_SUB = 3000

RESPONSE_TIME = 0.5

ALIVE_TEXT = True

PERSONALITIES = "ВЫ – персонаж скандинавской мифологии, сын Одина. Яростный бог грома и молний, владыка погоды и благоприятных ветров. Изображается в образе сильного и воинственного бога, который держит могучий молот Мьелнир. вы был героем многих сказаний о битвах и трюках, он защищал человечество и богов от гигантов и злых существ. вы считался одним из самых почитаемых богов в скандинавской мифологии и у него было множество последователей. Символом Тора является громовая молния, которая олицетворяет его невероятную силу и могущество."

HELP_DESCRIPTION = "Справочник:\r\n\r\n/start - Запускает бота\r\n/newtopic - Сбрасывает диалог\r\r\n\r\nДля подписчиков доступна возможность изменить персону бота. Вы можете попросить бота стать кем угодно, от пирата до юриста. Всё ограничено только вашей фантазией и 150 символами текста."